In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df=pd.read_csv("public_transportation_data.csv")

In [3]:
df.head(10)

,Unnamed: 0,insert_date,origin,destination,start_date,end_date,train_type,price,train_class,fare
0,0,2019-04-19 05:31:43,MADRID,SEVILLA,2019-05-29 06:20:00,2019-05-29 09:16:00,AV City,38.55,Turista,Promo
1,1,2019-04-19 05:31:43,MADRID,SEVILLA,2019-05-29 07:00:00,2019-05-29 09:32:00,AVE,53.40,Turista,Promo
2,2,2019-04-19 05:31:43,MADRID,SEVILLA,2019-05-29 07:30:00,2019-05-29 09:51:00,AVE,47.30,Turista,Promo
3,3,2019-04-19 05:31:43,MADRID,SEVILLA,2019-05-29 08:00:00,2019-05-29 10:32:00,AVE,69.40,Preferente,Promo
4,4,2019-04-19 05:31:43,MADRID,SEVILLA,2019-05-29 08:30:00,2019-05-29 11:14:00,ALVIA,NaN,Turista,Promo
5,5,2019-04-19 05:31:43,MADRID,SEVILLA,2019-05-29 09:00:00,2019-05-29 11:38:00,AVE,60.30,Turista,Promo
6,6,2019-04-19 05:31:43,MADRID,SEVILLA,2019-05-29 09:45:00,2019-05-29 12:27:00,INTERCITY,62.20,Turista,Flexible
7,7,2019-04-19 05:31:43,MADRID,SEVILLA,2019-05-29 10:00:00,2019-05-29 12:32:00,AVE,47.30,Turista,Promo
8,8,2019-04-19 05:31:43,MADRID,SEVILLA,2019-05-29 11:00:00,2019-05-29 13:32:00,AVE,53.40,Turista,Promo
9,9,2019-04-19 05:31:43,MADRID,SEVILLA,2019-05-29 11:05:00,2019-05-29 13:41:00,ALVIA,NaN,Turista,Promo

In [4]:
df.tail(10)

,Unnamed: 0,insert_date,origin,destination,start_date,end_date,train_type,price,train_class,fare
2579761,2579761,2019-04-19 05:31:38,MADRID,SEVILLA,2019-05-30 16:00:00,2019-05-30 18:30:00,AVE,76.30,Turista,Flexible
2579762,2579762,2019-04-19 05:31:38,MADRID,SEVILLA,2019-05-30 16:30:00,2019-05-30 18:51:00,AVE,76.30,Turista,Flexible
2579763,2579763,2019-04-19 05:31:38,MADRID,SEVILLA,2019-05-30 17:00:00,2019-05-30 19:38:00,AVE,76.30,Turista,Flexible
2579764,2579764,2019-04-19 05:31:38,MADRID,SEVILLA,2019-05-30 18:00:00,2019-05-30 20:32:00,AVE,60.30,Turista,Promo
2579765,2579765,2019-04-19 05:31:38,MADRID,SEVILLA,2019-05-30 18:35:00,2019-05-30 21:08:00,ALVIA,67.20,Turista,Flexible
2579766,2579766,2019-04-19 05:31:38,MADRID,SEVILLA,2019-05-30 19:00:00,2019-05-30 21:38:00,AVE,76.30,Turista,Flexible
2579767,2579767,2019-04-19 05:31:38,MADRID,SEVILLA,2019-05-30 19:30:00,2019-05-30 22:05:00,AVE,76.30,Turista,Flexible
2579768,2579768,2019-04-19 05:31:38,MADRID,SEVILLA,2019-05-30 20:00:00,2019-05-30 22:21:00,AVE,72.30,Turista Plus,Promo
2579769,2579769,2019-04-19 05:31:38,MADRID,SEVILLA,2019-05-30 20:35:00,2019-05-30 23:15:00,AVE,76.30,Turista,Flexible
2579770,2579770,2019-04-19 05:31:38,MADRID,SEVILLA,2019-05-30 21:25:00,2019-05-31 00:10:00,AV City,49.15,Turista,Promo

In [5]:
df=df.drop(columns=['Unnamed: 0'])

In [6]:
df=df.drop(columns=['insert_date'],axis=1)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2579771 entries, 0 to 2579770
Data columns (total 8 columns):
 #   Column       Dtype
---  ------       -----
 0   origin       object
 1   destination  object
 2   start_date   object
 3   end_date     object
 4   train_type   object
 5   price        float64
 6   train_class  object
 7   fare         object
dtypes: float64(1), object(7)
memory usage: 157.5+ MB

In [8]:
df.isnull().sum()

origin              0
destination         0
start_date          0
end_date            0
train_type          0
price          310681
train_class      9664
fare             9664
dtype: int64

In [9]:
df.describe()

              price
count  2.269090e+06
mean   6.338550e+01
std    2.578319e+01
min    1.545000e+01
25%    4.375000e+01
50%    6.030000e+01
75%    7.880000e+01
max    2.142000e+02

In [10]:
df['fare'].value_counts()

fare
Promo                  1733423
Flexible                582743
Adulto ida              179844
Promo +                  73778
Individual-Flexible        214
Mesa                        99
Grupos Ida                   6
Name: count, dtype: int64

In [11]:
df['train_type'].value_counts()

train_type
AVE          1789258
ALVIA         182267
REGIONAL      145898
INTERCITY      99840
AV City        72791
MD-LD          51585
LD             41209
AVE-TGV        34755
AVE-MD         34182
R. EXPRES      31918
AVE-LD         31472
LD-MD          27305
TRENHOTEL      19348
MD-AVE          7592
MD              5543
LD-AVE          4808
Name: count, dtype: int64

In [12]:
df['price'].mean()

np.float64(63.385503417669646)

In [13]:
df['price']=df['price'].fillna('63')

In [14]:
df.head()

,origin,destination,start_date,end_date,train_type,price,train_class,fare
0,MADRID,SEVILLA,2019-05-29 06:20:00,2019-05-29 09:16:00,AV City,38.55,Turista,Promo
1,MADRID,SEVILLA,2019-05-29 07:00:00,2019-05-29 09:32:00,AVE,53.4,Turista,Promo
2,MADRID,SEVILLA,2019-05-29 07:30:00,2019-05-29 09:51:00,AVE,47.3,Turista,Promo
3,MADRID,SEVILLA,2019-05-29 08:00:00,2019-05-29 10:32:00,AVE,69.4,Preferente,Promo
4,MADRID,SEVILLA,2019-05-29 08:30:00,2019-05-29 11:14:00,ALVIA,63,Turista,Promo

In [15]:
df['price']=df['price'].astype(int)

In [16]:
df.isnull().sum()

origin            0
destination       0
start_date        0
end_date          0
train_type        0
price             0
train_class    9664
fare           9664
dtype: int64

In [17]:
df['train_class'].value_counts()

train_class
Turista               1950303
Preferente             256082
Turista Plus           192908
Turista con enlace     169549
Cama Turista             1051
Cama G. Clase             214
Name: count, dtype: int64

In [18]:
df['destination'].value_counts()

destination
MADRID        1220348
BARCELONA      480074
SEVILLA        413155
VALENCIA       399679
PONFERRADA      66515
Name: count, dtype: int64

In [19]:
df['origin'].value_counts()

origin
MADRID        1359423
BARCELONA      405621
SEVILLA        398445
VALENCIA       323086
PONFERRADA      93196
Name: count, dtype: int64

In [20]:
df=df.dropna()

In [21]:
df.isnull().sum()

origin         0
destination    0
start_date     0
end_date       0
train_type     0
price          0
train_class    0
fare           0
dtype: int64

In [22]:
df['fare'].value_counts()

fare
Promo                  1733423
Flexible                582743
Adulto ida              179844
Promo +                  73778
Individual-Flexible        214
Mesa                        99
Grupos Ida                   6
Name: count, dtype: int64

In [23]:
#lets fill all the empty fare with mesa 
df['fare']=df['fare'].fillna('Mesa')

In [24]:
df.isnull().sum()

origin         0
destination    0
start_date     0
end_date       0
train_type     0
price          0
train_class    0
fare           0
dtype: int64

In [25]:
df.shape

(2570107, 8)

In [26]:
from sklearn.model_selection import train_test_split  # Splitting data into train & test sets
from sklearn.preprocessing import OneHotEncoder, LabelEncoder  # Encoding categorical features
from sklearn.preprocessing import StandardScaler  # Scaling numerical features
from sklearn.linear_model import LinearRegression  # Linear Regression model
from sklearn.ensemble import RandomForestRegressor  # Random Forest model
from sklearn.metrics import mean_absolute_error, mean_squared_error, r2_score

In [48]:
import json

categorical_cols = ['origin', 'destination', 'train_type', 'train_class', 'fare']
label_encoders = {}

for col in categorical_cols:
    le = LabelEncoder()
    df[col] = le.fit_transform(df[col])
    label_encoders[col] = le  # Store label encoders

# Convert label encoders to a JSON-serializable format
label_encoders_json = {col: le.classes_.tolist() for col, le in label_encoders.items()}

# Save as JSON
with open("label_encoders.json", "w") as f:
    json.dump(label_encoders_json, f)

print(" label_encoders.json has been created successfully!")

 label_encoders.json has been created successfully!

In [28]:
df.head()

,origin,destination,start_date,end_date,train_type,price,train_class,fare
0,1,3,2019-05-29 06:20:00,2019-05-29 09:16:00,1,38,3,5
1,1,3,2019-05-29 07:00:00,2019-05-29 09:32:00,2,53,3,5
2,1,3,2019-05-29 07:30:00,2019-05-29 09:51:00,2,47,3,5
3,1,3,2019-05-29 08:00:00,2019-05-29 10:32:00,2,69,2,5
4,1,3,2019-05-29 08:30:00,2019-05-29 11:14:00,0,63,3,5

In [29]:
df['destination'].value_counts()

destination
1    1214369
0     479185
3     412366
4     399214
2      64973
Name: count, dtype: int64

MADRID - 1, BARCELONA - 0, SEVILLA - 3, VALENCIA - 4, PONFERRADA - 2

In [30]:
df['origin'].value_counts()

origin
1    1355738
0     405536
3     395799
4     322445
2      90589
Name: count, dtype: int64

MADRID - 1, BARCELONA - 0, SEVILLA - 3, VALENCIA - 4, PONFERRADA - 2

In [31]:
df['fare'].value_counts()

fare
5    1733423
1     582743
0     179844
6      73778
3        214
4         99
2          6
Name: count, dtype: int64

Promo - 5, Flexible - 1, Adulto ida - 0, Promo + - 6, Individual Flexible - 4, Mesa - 3, Grupos Ida - 6

In [32]:
df['train_class'].value_counts()

train_class
3    1950303
2     256082
4     192908
5     169549
1       1051
0        214
Name: count, dtype: int64

Turista - 3, Preferente -2, Turista Plus - 4, Turista con enlace - 5, Cama Turista - 0, Cama G. Clase - 1

In [33]:
df['train_type'].value_counts()

train_type
2     1787182
0      180888
14     145898
6       99347
1       70656
12      50938
7       40056
5       34755
4       34008
13      31917
3       31339
9       27138
15      18266
11       7368
10       5543
8        4808
Name: count, dtype: int64

AVE - 2, ALVIA - 0, REGIONAL - 14, INTERCITY - 6, AV City - 1 , MD-LD - 12, LD - 7 , AVE-TGV - 5, AVE-MD - 4, R. EXPRES - 13, AVE-LD - 3, LD-MD - 9, TRENHOTEL - 15, MD-AVE - 11, MD - 10, LD-AVE - 8

In [34]:
df['start_date'] = pd.to_datetime(df['start_date'])
df['s_hour'] = df['start_date'].dt.hour
df['s_day_of_week'] = df['start_date'].dt.dayofweek
df['s_month'] = df['start_date'].dt.month

In [35]:
df['end_date'] = pd.to_datetime(df['end_date'])

# Extract useful time-related features
df['end_hour'] = df['end_date'].dt.hour
df['end_day_of_week'] = df['end_date'].dt.dayofweek
df['end_month'] = df['end_date'].dt.month

In [36]:
#travel duration of train in minutes 
df['start_date'] = pd.to_datetime(df['start_date'])
df['travel_duration'] = (df['end_date'] - df['start_date']).dt.total_seconds() / 60 #in minutes

In [37]:
df = df.drop(columns=['end_date','start_date'],axis=1)

In [38]:
df=df.drop(columns=['s_hour','s_day_of_week','s_month','end_hour','end_day_of_week','end_month'],axis=1)

In [39]:
df.head()

   origin  destination  train_type  price  train_class  fare  travel_duration
0       1            3           1     38            3     5            176.0
1       1            3           2     53            3     5            152.0
2       1            3           2     47            3     5            141.0
3       1            3           2     69            2     5            152.0
4       1            3           0     63            3     5            164.0

# model selection

In [40]:
X=df.drop(columns=['price'])
y=df['price']

In [41]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [42]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
X_train_scaled = scaler.fit_transform(X_train)
X_test_scaled = scaler.transform(X_test)

In [43]:
lr = LinearRegression()
lr.fit(X_train, y_train)

# Make predictions
y_pred = lr.predict(X_test)

In [44]:
print("MAE:", mean_absolute_error(y_test, y_pred))
print("MSE:", mean_squared_error(y_test, y_pred))
print("R2 Score:", r2_score(y_test, y_pred))

MAE: 10.921795016086879
MSE: 218.19746604922426
R2 Score: 0.6291974628738093

In [45]:
rf = RandomForestRegressor(n_estimators=100,max_depth=10)
rf.fit(X_train, y_train)

y_pred_rf = rf.predict(X_test)

print("Random Forest MAE:", mean_absolute_error(y_test, y_pred_rf))
print("Random Forest MSE:", mean_squared_error(y_test, y_pred_rf))
print("Random Forest R2 Score:", r2_score(y_test, y_pred_rf))

Random Forest MAE: 6.698535176348239
Random Forest MSE: 104.9414075064749
Random Forest R2 Score: 0.8216636478069095

# saving the model

In [47]:
import json
from sklearn.ensemble import RandomForestRegressor

# Save model parameters
params = rf.get_params()
with open("train_price_model_params.json", "w") as f:
    json.dump(params, f)

print("Model parameters saved successfully as train_price_model_params.json")

Model parameters saved successfully as train_price_model_params.json